<?xml version="1.0" ?>
<net batch="1" name="PVANet + R-FCN" version="5">
	<layers>
		<layer id="0" name="data" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>544</dim>
					<dim>992</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="ScaleShift/Add_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>544</dim>
					<dim>992</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>544</dim>
					<dim>992</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="6"/>
				<biases offset="6" size="6"/>
			</blobs>
		</layer>
		<layer id="2" name="conv1_1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="7,7" output="16" pads_begin="3,3" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>544</dim>
					<dim>992</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12" size="4704"/>
				<biases offset="4716" size="32"/>
			</blobs>
		</layer>
		<layer id="3" name="conv1_1/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1_1/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1_1/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4748" size="64"/>
				<biases offset="4812" size="64"/>
			</blobs>
		</layer>
		<layer id="6" name="conv1_1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="pool1" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>272</dim>
					<dim>496</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2_1/1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4876" size="1536"/>
				<biases offset="6412" size="48"/>
			</blobs>
		</layer>
		<layer id="9" name="conv2_1/1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2_1/2/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6460" size="10368"/>
				<biases offset="16828" size="48"/>
			</blobs>
		</layer>
		<layer id="11" name="conv2_1/2/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv2_1/2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2_1/2/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="16876" size="96"/>
				<biases offset="16972" size="96"/>
			</blobs>
		</layer>
		<layer id="14" name="conv2_1/2/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2_1/3/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="17068" size="6144"/>
				<biases offset="23212" size="128"/>
			</blobs>
		</layer>
		<layer id="16" name="conv2_1/proj" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="23340" size="4096"/>
				<biases offset="27436" size="128"/>
			</blobs>
		</layer>
		<layer id="17" name="conv2_1" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2_2/1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="27564" size="3072"/>
				<biases offset="30636" size="48"/>
			</blobs>
		</layer>
		<layer id="19" name="conv2_2/1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv2_2/2/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30684" size="10368"/>
				<biases offset="41052" size="48"/>
			</blobs>
		</layer>
		<layer id="21" name="conv2_2/2/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv2_2/2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv2_2/2/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="41100" size="96"/>
				<biases offset="41196" size="96"/>
			</blobs>
		</layer>
		<layer id="24" name="conv2_2/2/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2_2/3/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="41292" size="6144"/>
				<biases offset="47436" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="conv2_2" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2_3/1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="47564" size="3072"/>
				<biases offset="50636" size="48"/>
			</blobs>
		</layer>
		<layer id="28" name="conv2_3/1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2_3/2/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
			<blobs>
				<weights offset="50684" size="10368"/>
				<biases offset="61052" size="48"/>
			</blobs>
		</layer>
		<layer id="30" name="conv2_3/2/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv2_3/2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Pooling_" precision="FP16" type="Pooling">
			<data kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv2_3/2/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="61100" size="96"/>
				<biases offset="61196" size="96"/>
			</blobs>
		</layer>
		<layer id="34" name="conv2_3/2/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2_3/3/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="61292" size="6144"/>
				<biases offset="67436" size="128"/>
			</blobs>
		</layer>
		<layer id="36" name="Pooling_4086" precision="FP16" type="Pooling">
			<data kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>248</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv2_3" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv3_1/1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="67564" size="6144"/>
				<biases offset="73708" size="96"/>
			</blobs>
		</layer>
		<layer id="39" name="conv3_1/1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv3_1/2/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="73804" size="41472"/>
				<biases offset="115276" size="96"/>
			</blobs>
		</layer>
		<layer id="41" name="conv3_1/2/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv3_1/2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv3_1/2/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="115372" size="192"/>
				<biases offset="115564" size="192"/>
			</blobs>
		</layer>
		<layer id="44" name="conv3_1/2/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv3_1/3/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="115756" size="24576"/>
				<biases offset="140332" size="256"/>
			</blobs>
		</layer>
		<layer id="46" name="conv3_1/proj" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="140588" size="16384"/>
				<biases offset="156972" size="256"/>
			</blobs>
		</layer>
		<layer id="47" name="conv3_1" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv3_2/1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="157228" size="12288"/>
				<biases offset="169516" size="96"/>
			</blobs>
		</layer>
		<layer id="49" name="conv3_2/1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv3_2/2/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="169612" size="41472"/>
				<biases offset="211084" size="96"/>
			</blobs>
		</layer>
		<layer id="51" name="conv3_2/2/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="conv3_2/2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv3_2/2/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="211180" size="192"/>
				<biases offset="211372" size="192"/>
			</blobs>
		</layer>
		<layer id="54" name="conv3_2/2/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv3_2/3/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="211564" size="24576"/>
				<biases offset="236140" size="256"/>
			</blobs>
		</layer>
		<layer id="56" name="conv3_2" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv3_3/1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="236396" size="12288"/>
				<biases offset="248684" size="96"/>
			</blobs>
		</layer>
		<layer id="58" name="conv3_3/1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv3_3/2/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="248780" size="41472"/>
				<biases offset="290252" size="96"/>
			</blobs>
		</layer>
		<layer id="60" name="conv3_3/2/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv3_3/2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv3_3/2/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="290348" size="192"/>
				<biases offset="290540" size="192"/>
			</blobs>
		</layer>
		<layer id="63" name="conv3_3/2/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv3_3/3/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="290732" size="24576"/>
				<biases offset="315308" size="256"/>
			</blobs>
		</layer>
		<layer id="65" name="conv3_3" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv3_4/1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="315564" size="12288"/>
				<biases offset="327852" size="96"/>
			</blobs>
		</layer>
		<layer id="67" name="conv3_4/1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv3_4/2/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="327948" size="41472"/>
				<biases offset="369420" size="96"/>
			</blobs>
		</layer>
		<layer id="69" name="conv3_4/2/neg" precision="FP16" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv3_4/2/concat" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv3_4/2/scale/Mul_/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="369516" size="192"/>
				<biases offset="369708" size="192"/>
			</blobs>
		</layer>
		<layer id="72" name="conv3_4/2/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv3_4/3/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
			<blobs>
				<weights offset="369900" size="24576"/>
				<biases offset="394476" size="256"/>
			</blobs>
		</layer>
		<layer id="74" name="conv3_4" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="downsample" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv4_1/incep/0/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="394732" size="16384"/>
				<biases offset="411116" size="128"/>
			</blobs>
		</layer>
		<layer id="77" name="conv4_1/incep/0/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv4_1/incep/1_reduce/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="411244" size="12288"/>
				<biases offset="423532" size="96"/>
			</blobs>
		</layer>
		<layer id="79" name="conv4_1/incep/1_reduce/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv4_1/incep/1_0/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="423628" size="110592"/>
				<biases offset="534220" size="256"/>
			</blobs>
		</layer>
		<layer id="81" name="conv4_1/incep/1_0/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv4_1/incep/2_reduce/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="534476" size="6144"/>
				<biases offset="540620" size="48"/>
			</blobs>
		</layer>
		<layer id="83" name="conv4_1/incep/2_reduce/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv4_1/incep/2_0/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="540668" size="20736"/>
				<biases offset="561404" size="96"/>
			</blobs>
		</layer>
		<layer id="85" name="conv4_1/incep/2_0/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv4_1/incep/2_1/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="561500" size="41472"/>
				<biases offset="602972" size="96"/>
			</blobs>
		</layer>
		<layer id="87" name="conv4_1/incep/2_1/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv4_1/incep/pool" precision="FP16" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv4_1/incep/poolproj/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="603068" size="32768"/>
				<biases offset="635836" size="256"/>
			</blobs>
		</layer>
		<layer id="90" name="conv4_1/incep/poolproj/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv4_1/incep" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>368</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv4_1/out/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>368</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="636092" size="188416"/>
				<biases offset="824508" size="512"/>
			</blobs>
		</layer>
		<layer id="93" name="conv4_1/proj" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>68</dim>
					<dim>124</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="825020" size="65536"/>
				<biases offset="890556" size="512"/>
			</blobs>
		</layer>
		<layer id="94" name="conv4_1" precision="FP16" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv4_2/incep/0/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="891068" size="32768"/>
				<biases offset="923836" size="128"/>
			</blobs>
		</layer>
		<layer id="96" name="conv4_2/incep/0/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="conv4_2/incep/1_reduce/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="923964" size="32768"/>
				<biases offset="956732" size="128"/>
			</blobs>
		</layer>
		<layer id="98" name="conv4_2/incep/1_reduce/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="conv4_2/incep/1_0/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="956860" size="147456"/>
				<biases offset="1104316" size="256"/>
			</blobs>
		</layer>
		<layer id="100" name="conv4_2/incep/1_0/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="conv4_2/incep/2_reduce/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1104572" size="12288"/>
				<biases offset="1116860" size="48"/>
			</blobs>
		</layer>
		<layer id="102" name="conv4_2/incep/2_reduce/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv4_2/incep/2_0/conv" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="48" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1116908" size="20736"/>
				<biases offset="1137644" size="96"/>
			</blobs>
		</layer>
		<layer id="104" name="conv4_2/incep/2_0/relu" precision="FP16" type="ReLU">
			<data negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>34</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="conv4_2/incep/2_1/conv" precision="FP16" type="Convolution">
